v2206/atmospheric_Microclimate/windAroundBuildings_CFDHAM_veg/system/air/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    trees;
        type    cellSet;
        action  new;
        source surfaceToCell;
        sourceInfo
        {
            file            "constant/triSurface/trees.stl";
            outsidePoints   ((-100 -100 100));
            includeCut      true;
            includeInside   true;
            includeOutside  false;
            nearDistance    -1;
            curvature       -100;
        }
    }
    {
        name    trees;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set    trees;
        }
    }
);

// ************************************************************************* //
